



Internet Engineering Task Force                                G. Lozano
Internet-Draft                                                     ICANN
Intended status: Standards Track                        January 21, 2016
Expires: July 24, 2016


    Registrar Registration Expiration Date Extension Mapping for the
                 Extensible Provisioning Protocol (EPP)
         draft-lozano-ietf-eppext-registrar-expiration-date-00

Abstract

   This document describes an Extensible Provisioning Protocol (EPP)
   extension mapping for the provisioning and management of the
   registrar registration expiration date for domain names stored in a
   shared central repository.  Specified in XML, this mapping extends
   the EPP domain name mapping.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at http://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on July 24, 2016.

Copyright Notice

   Copyright (c) 2016 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (http://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of




Lozano                    Expires July 24, 2016                 [Page 1]

Internet-Draft   Registrar Registration Expiration Date     January 2016


   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Object Elements . . . . . . . . . . . . . . . . . . . . . . .   3
     2.1.  Registrar Registration Expiration Date  . . . . . . . . .   3
     2.2.  EPP Command Mapping . . . . . . . . . . . . . . . . . . .   3
   3.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .  12
     3.1.  rrExDate Schema . . . . . . . . . . . . . . . . . . . . .  12
   4.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  13
   5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  13
   6.  Security Considerations . . . . . . . . . . . . . . . . . . .  14
   7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  14
     7.1.  Normative References  . . . . . . . . . . . . . . . . . .  14
     7.2.  Informative References  . . . . . . . . . . . . . . . . .  15
   Author's Address  . . . . . . . . . . . . . . . . . . . . . . . .  15

1.  Introduction

   This document describes an extension mapping for version 1.0 of the
   Extensible Provisioning Protocol (EPP) described in RFC [RFC5730].
   This mapping, an extension of the domain name mapping described in
   RFC [RFC5731], is specified using the Extensible Markup Language
   (XML) 1.0 [W3C.REC-xml] and XML Schema notation
   ([W3C.REC-xmlschema-1] [W3C.REC-xmlschema-2]).

   The EPP core protocol specification [RFC5730] provides a complete
   description of EPP command and response structures.  A thorough
   understanding of the base protocol specification is necessary to
   understand the mapping described in this document.

   This document is written following the Guidelines for Extending the
   Extensible Provisioning Protocol as defined in [RFC3735].

   This extension is defined in order to support the Internet
   Corporation for Assigned Names and Numbers (ICANN) Thick Whois Policy
   Recommendation [ThickWhoisPolicy] that requires gTLD domain name
   registries to display the registrar registration expiration date in
   the Registration Data Directory Service (e.g.  Whois, RDAP),
   therefore a mechanism to transmit this information from the registrar
   to the registry is required.  The EPP mapping described in this
   document provides such mechanism.






Lozano                    Expires July 24, 2016                 [Page 2]

Internet-Draft   Registrar Registration Expiration Date     January 2016


1.1.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

   In examples, "C:" represents lines sent by a protocol client, and
   "S:" represents lines returned by a protocol server. "////" is used
   to note element values that have been shortened to better fit page
   boundaries.  Indentation and white space in examples is provided only
   to illustrate element relationships and is not a mandatory feature of
   this protocol.

   XML is case sensitive.  Unless stated otherwise, XML specifications
   and examples provided in this document MUST be interpreted in the
   character case presented in order to develop a conforming
   implementation.

   rrExDate-1.0 is used as an abbreviation for
   urn:ietf:params:xml:ns:rrExDate-1.0.  The XML namespace prefix
   "rrExDate" is used, but implementations MUST NOT depend on it and
   instead employ a proper namespace-aware XML parser and serializer to
   interpret and output the XML documents.

2.  Object Elements

   This extension adds additional elements to the EPP domain name
   mapping [RFC5731].  Only those new elements are described here.

2.1.  Registrar Registration Expiration Date

   The rrExDate:exDate element is used by the registrar to specify the
   registrar registration expiration date.

2.2.  EPP Command Mapping

   A detailed description of the EPP syntax and semantics can be found
   in the EPP core protocol specification [RFC5730].  The command
   mappings described here are specifically for use in provisioning and
   managing of the registrar registration expiration date via EPP.

2.2.1.  EPP Query commands

   EPP provides three commands to retrieve object information: <check>
   to determine if an object is known to the server, <info> to retrieve
   detailed information associated with an object, and <transfer> to
   retrieve object transfer status information.




Lozano                    Expires July 24, 2016                 [Page 3]

Internet-Draft   Registrar Registration Expiration Date     January 2016


2.2.1.1.  EPP <check> command

   This extension does not add any elements to the EPP <check> command
   or <check> response described in the EPP domain mapping [RFC5731].

2.2.1.2.  EPP <info> command

   This extension does not add any elements to the EPP <info> command,
   but does include elements in the response.

   After an info command has been processed successfully, the server
   MUST include a <rrExDate:rrExDateData> object with the
   <rrExDate:exDate> element in the <extension> section of the EPP
   response.

   Example <info> response for a domain object that includes the
   registrar registration expiration date:


































Lozano                    Expires July 24, 2016                 [Page 4]

Internet-Draft   Registrar Registration Expiration Date     January 2016


S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
S:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
S:    <response>
S:        <result code="1000">
S:            <msg>Command completed successfully</msg>
S:        </result>
S:        <resData>
S:            <domain:infData
S:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
S:                <domain:name>example.com</domain:name>
S:                <domain:roid>EXAMPLE1-REP</domain:roid>
S:                <domain:status s="ok"/>
S:                <domain:registrant>jd1234</domain:registrant>
S:                <domain:contact type="admin">sh8013</domain:contact>
S:                <domain:contact type="tech">sh8013</domain:contact>
S:                <domain:ns>
S:                    <domain:hostObj>ns1.example.com</domain:hostObj>
S:                    <domain:hostObj>ns1.example.net</domain:hostObj>
S:                </domain:ns>
S:                <domain:clID>ClientX</domain:clID>
S:                <domain:crID>ClientY</domain:crID>
S:                <domain:crDate>1999-04-03T22:00:00.0Z</domain:crDate>
S:                <domain:upID>ClientX</domain:upID>
S:                <domain:upDate>1999-12-03T09:00:00.0Z</domain:upDate>
S:                <domain:exDate>2005-04-03T22:00:00.0Z</domain:exDate>
S:                <domain:trDate>2000-04-08T09:00:00.0Z</domain:trDate>
S:                <domain:authInfo>
S:                    <domain:pw>2fooBAR</domain:pw>
S:                </domain:authInfo>
S:            </domain:infData>
S:        </resData>
S:        <extension>
S:            <rrExDate:rrExDateData
S:                xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0" >
S:                <rrExDate:exDate>
S:                    2004-04-03T22:00:00.0Z
S:                </rrExDate:exDate>
S:        </extension>
S:        <trID>
S:            <clTRID>ABC-12345</clTRID>
S:            <svTRID>54322-XYZ</svTRID>
S:        </trID>
S:    </response>
S:</epp>






Lozano                    Expires July 24, 2016                 [Page 5]

Internet-Draft   Registrar Registration Expiration Date     January 2016


2.2.1.3.  EPP <transfer> command

   This extension does not add any elements to the EPP <transfer>
   command, but does include elements in the response.

   A response to a <transfer> query command MUST include a
   <rrExDate:rrExDateData> object in the <extension> section of the EPP
   response if a <rrExDate:exDate> element was provided by the client
   when creating the transfer request.

   Example <transfer> query response that includes the registrar
   registration expiration date specified when the <transfer> request
   was created:

S:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
S:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
S:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
S:    <response>
S:        <result code="1000">
S:            <msg>Command completed successfully</msg>
S:        </result>
S:        <resData>
S:            <domain:trnData
S:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
S:                <domain:name>example.com</domain:name>
S:                <domain:trStatus>pending</domain:trStatus>
S:                <domain:reID>ClientX</domain:reID>
S:                <domain:reDate>2000-06-06T22:00:00.0Z</domain:reDate>
S:                <domain:acID>ClientY</domain:acID>
S:                <domain:acDate>2000-06-11T22:00:00.0Z</domain:acDate>
S:                <domain:exDate>2002-09-08T22:00:00.0Z</domain:exDate>
S:            </domain:trnData>
S:        </resData>
S:        <extension>
S:            <rrExDate:rrExDateData
S:                xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0" >
S:                <rrExDate:exDate>
S:                    2004-04-03T22:00:00.0Z
S:                </rrExDate:exDate>
S:            </rrExDate:rrExDateData>
S:        </extension>
S:        <trID>
S:            <clTRID>ABC-12345</clTRID>
S:            <svTRID>54322-XYZ</svTRID>
S:        </trID>
S:    </response>
S:</epp>




Lozano                    Expires July 24, 2016                 [Page 6]

Internet-Draft   Registrar Registration Expiration Date     January 2016


2.2.2.  EPP Transform commands

   The following general requirements apply to the <create>, <renew>,
   <transfer>, and <update> commands:

      If this extension is selected by the client during the <login>
      command, after successfully processing an EPP Transform Command
      that does not include this extension, the value of the registrar
      registration expiration date in the central repository MUST be set
      to the expiration date (<domain:exDate>) of the domain object
      after executing the transform command.

      If this extension is selected by the client during the <login>
      command, after successfully processing an EPP Transform Command
      that includes a rrExDate:exDate element, the value of the
      registrar registration expiration date in the central repository
      MUST be set to the value in the rrExDate:exDate element.

      A server MUST return a 2004 response code when receiving an EPP
      transform command that includes this extension with a value in the
      rExDate:exDate element that precedes the creation date
      (<domain:crDate>) of the domain object.

2.2.2.1.  EPP <create> command

   This extension defines additional elements for the EPP <create>
   command.  The general requirements for EPP transform commands
   described above apply to the EPP <create> command.

   This extension does not add any elements to the EPP <create> response
   described in the EPP domain mapping [RFC5731].

   Example <create> command that includes the registrar registration
   expiration date:

















Lozano                    Expires July 24, 2016                 [Page 7]

Internet-Draft   Registrar Registration Expiration Date     January 2016


C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
C:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
C:    <command>
C:        <create>
C:            <domain:create
C:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
C:                <domain:name>example.com</domain:name>
C:                <domain:period unit="y">2</domain:period>
C:                <domain:ns>
C:                    <domain:hostObj>ns1.example.net</domain:hostObj>
C:                    <domain:hostObj>ns2.example.net</domain:hostObj>
C:                </domain:ns>
C:                <domain:registrant>jd1234</domain:registrant>
C:                <domain:contact type="admin">sh8013</domain:contact>
C:                <domain:contact type="tech">sh8013</domain:contact>
C:                <domain:authInfo>
C:                    <domain:pw>2fooBAR</domain:pw>
C:                </domain:authInfo>
C:            </domain:create>
C:        </create>
C:        <extension>
C:            <rrExDate:rrExDateData
C:                xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0" >
C:                <rrExDate:exDate>
C:                    2004-04-03T22:00:00.0Z
C:                </rrExDate:exDate>
C:            </rrExDate:rrExDateData>
C:        </extension>
C:        <clTRID>ABC-12345</clTRID>
C:    </command>
C:</epp>

   Example <create> command that sets the registrar registration
   expiration date to the expiration date (<domain:exDate>) of the
   domain object, if it is successfully created:















Lozano                    Expires July 24, 2016                 [Page 8]

Internet-Draft   Registrar Registration Expiration Date     January 2016


  C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
  C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
  C:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  C:    <command>
  C:        <create>
  C:            <domain:create
  C:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
  C:                <domain:name>example.com</domain:name>
  C:                <domain:period unit="y">2</domain:period>
  C:                <domain:ns>
  C:                    <domain:hostObj>ns1.example.net</domain:hostObj>
  C:                    <domain:hostObj>ns2.example.net</domain:hostObj>
  C:                </domain:ns>
  C:                <domain:registrant>jd1234</domain:registrant>
  C:                <domain:contact type="admin">sh8013</domain:contact>
  C:                <domain:contact type="tech">sh8013</domain:contact>
  C:                <domain:authInfo>
  C:                    <domain:pw>2fooBAR</domain:pw>
  C:                </domain:authInfo>
  C:            </domain:create>
  C:        </create>
  C:        <clTRID>ABC-12345</clTRID>
  C:    </command>
  C:</epp>

2.2.2.2.  EPP <delete> command

   This extension does not add any elements to the EPP <delete> command
   or <delete> response described in the EPP domain mapping [RFC5731].

2.2.2.3.  EPP <renew> command

   This extension defines additional elements for the EPP <renew>
   command.  The general requirements for EPP transform commands
   described above apply to the EPP <renew> command.

   This extension does not add any elements to the EPP <renew> response
   described in the EPP domain mapping [RFC5731].

   Example <renew> command that includes the registrar registration
   expiration date:










Lozano                    Expires July 24, 2016                 [Page 9]

Internet-Draft   Registrar Registration Expiration Date     January 2016


C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
C:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
C:    <command>
C:        <renew>
C:            <domain:renew
C:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
C:                <domain:name>example.com</domain:name>
C:                <domain:curExpDate>2000-04-03</domain:curExpDate>
C:                <domain:period unit="y">5</domain:period>
C:            </domain:renew>
C:        </renew>
C:        <extension>
C:            <rrExDate:rrExDateData
C:                xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0" >
C:                <rrExDate:exDate>
C:                    2004-04-03T22:00:00.0Z
C:                </rrExDate:exDate>
C:            </rrExDate:rrExDateData>
C:        </extension>
C:        <clTRID>ABC-12345</clTRID>
C:    </command>
C:</epp>

2.2.2.4.  EPP <transfer> command

   This extension defines additional elements for the EPP <transfer>
   command.  The general requirements for EPP transform commands
   described above apply to the EPP <transfer> command.

   This extension does not add any elements to the EPP <transfer>
   response described in the EPP domain mapping [RFC5731].

   Example <transfer> command that includes the registrar registration
   expiration date:
















Lozano                    Expires July 24, 2016                [Page 10]

Internet-Draft   Registrar Registration Expiration Date     January 2016


C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
C:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
C:    <command>
C:        <transfer op="request">
C:            <domain:transfer
C:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
C:                <domain:name>example.com</domain:name>
C:                <domain:period unit="y">1</domain:period>
C:                <domain:authInfo>
C:                    <domain:pw roid="JD1234-REP">2fooBAR</domain:pw>
C:                </domain:authInfo>
C:            </domain:transfer>
C:        </transfer>
C:        <extension>
C:            <rrExDate:rrExDateData
C:                xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0" >
C:                <rrExDate:exDate>
C:                    2004-04-03T22:00:00.0Z
C:                </rrExDate:exDate>
C:            </rrExDate:rrExDateData>
C:        </extension>
C:        <clTRID>ABC-12345</clTRID>
C:    </command>
C:</epp>

2.2.2.5.  EPP <update> command

   This extension defines additional elements for the EPP <update>
   command.  The general requirements for EPP transform commands
   described above apply to the EPP <update> command.

   This extension does not add any elements to the EPP <update> response
   described in the EPP domain mapping [RFC5731].

   Example <update> command that includes the registrar registration
   expiration date:














Lozano                    Expires July 24, 2016                [Page 11]

Internet-Draft   Registrar Registration Expiration Date     January 2016


C:<?xml version="1.0" encoding="UTF-8" standalone="no"?>
C:<epp xmlns="urn:ietf:params:xml:ns:epp-1.0"
C:     xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
C:    <command>
C:        <update>
C:            <domain:update
C:                xmlns:domain="urn:ietf:params:xml:ns:domain-1.0">
C:                <domain:name>example.com</domain:name>
C:            </domain:update>
C:        </update>
C:        <extension>
C:            <rrExDate:rrExDateData
C:                xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0" >
C:                <rrExDate:exDate>
C:                    2004-04-03T22:00:00.0Z
C:                </rrExDate:exDate>
C:            </rrExDate:rrExDateData>
C:        </extension>
C:        <clTRID>ABC-12345</clTRID>
C:    </command>
C:</epp>

3.  Formal Syntax

   An EPP object mapping is specified in XML Schema notation.  The
   formal syntax presented here is a complete schema representation of
   the object mapping suitable for automated validation of EPP XML
   instances.

3.1.  rrExDate Schema

   Copyright (c) 2016 IETF Trust and the persons identified as authors
   of the code.  All rights reserved.

   Redistribution and use in source and binary forms, with or without
   modification, is permitted pursuant to, and subject to the license
   terms contained in, the Simplified BSD License set forth in
   Section 4.c of the IETF Trust's Legal Provisions Relating to IETF
   Documents (http://trustee.ietf.org/license-info).












Lozano                    Expires July 24, 2016                [Page 12]

Internet-Draft   Registrar Registration Expiration Date     January 2016


 BEGIN
 <?xml version="1.0" encoding="UTF-8"?>
 <schema xmlns="http://www.w3.org/2001/XMLSchema"
     xmlns:rrExDate="urn:ietf:params:xml:ns:rrExDate-1.0"
     targetNamespace="urn:ietf:params:xml:ns:rrExDate-1.0"
     elementFormDefault="qualified">
     <annotation>
         <documentation>
             Extensible Provisioning Protocol v1.0 domain name extension
             schema for implementing the ICANN thick whois policy.
         </documentation>
     </annotation>
     <!-- Transmission of the Registrar Registration Expiration Date
         from the Registrar to the Registry -->
     <element name="rrExDateData" type="rrExDate:rrExDateDataType"/>
     <complexType name="rrExDateDataType">
         <sequence>
             <element name="exDate" type="dateTime" />
         </sequence>
     </complexType>
     <!-- End of schema. -->
 </schema>
 END

4.  Acknowledgements

   TBD

5.  IANA Considerations

   This document uses URNs to describe XML namespaces and XML schemas
   conforming to a registry mechanism described in [RFC3688].  Two URI
   assignments have been registered by the IANA.

   Registration request for the rrExDate namespace:

      URI: urn:ietf:params:xml:ns:rrExDate-1.0"

      Registrant Contact: IESG

      XML: None.  Namespace URIs do not represent an XML specification.

   Registration request for the rrExDate schema:

      URI: urn:ietf:params:xml:ns:rrExDate-1.0"

      Registrant Contact: IESG




Lozano                    Expires July 24, 2016                [Page 13]

Internet-Draft   Registrar Registration Expiration Date     January 2016


      XML: See the "Formal Syntax" section of this document.

6.  Security Considerations

   The mapping extensions described in this document do not provide any
   security services beyond those described by EPP [RFC5730], the EPP
   domain name mapping [RFC5731], and protocol layers used by EPP.  The
   security considerations described in these other specifications apply
   to this specification as well.

7.  References

7.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <http://www.rfc-editor.org/info/rfc2119>.

   [RFC3688]  Mealling, M., "The IETF XML Registry", BCP 81, RFC 3688,
              DOI 10.17487/RFC3688, January 2004,
              <http://www.rfc-editor.org/info/rfc3688>.

   [RFC3735]  Hollenbeck, S., "Guidelines for Extending the Extensible
              Provisioning Protocol (EPP)", RFC 3735,
              DOI 10.17487/RFC3735, March 2004,
              <http://www.rfc-editor.org/info/rfc3735>.

   [RFC5730]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)",
              STD 69, RFC 5730, DOI 10.17487/RFC5730, August 2009,
              <http://www.rfc-editor.org/info/rfc5730>.

   [RFC5731]  Hollenbeck, S., "Extensible Provisioning Protocol (EPP)
              Domain Name Mapping", STD 69, RFC 5731,
              DOI 10.17487/RFC5731, August 2009,
              <http://www.rfc-editor.org/info/rfc5731>.

   [W3C.REC-xml]
              W3C, "Extensible Markup Language (XML) 1.0 (Second
              Edition)", Oct 2000, <https://www.w3.org/TR/REC-xml/>.

   [W3C.REC-xmlschema-1]
              W3C, "XML Schema Part 1: Structures Second Edition", Oct
              2004, <http://www.w3.org/TR/xmlschema-1/>.

   [W3C.REC-xmlschema-2]
              W3C, "XML Schema Part 2: Structures Second Edition", Oct
              2004, <https://www.w3.org/TR/xmlschema-2/>.



Lozano                    Expires July 24, 2016                [Page 14]

Internet-Draft   Registrar Registration Expiration Date     January 2016


7.2.  Informative References

   [ThickWhoisPolicy]
              ICANN, "GNSO Council Policy Recommendations for a new
              Consensus Policy on Thick Whois", Oct 2013,
              <https://www.w3.org/TR/xmlschema-2/>.

Author's Address

   Gustavo Lozano
   ICANN
   12025 Waterfront Drive, Suite 300
   Los Angeles  90292
   US

   Phone: +1.3103015800
   Email: gustavo.lozano@icann.org


































Lozano                    Expires July 24, 2016                [Page 15]
